package com.lesson1;

/*
Написать программу которая на 1 строке выводит ваше Фамилия Имя а на второй ваш город
и сбросить сслыку на gist в LMS
 */

public class Homework1 {

    public static void main(String[] args) {
        System.out.println("Авдеенко Роман\nОдесса");
    }
}
